import { Router } from "express";

const router = new Router();

router.get("/"); // ОТРИМАННЯ ВСІХ ТЕСТІВ З ПОШУКОМ ТА ФІЛЬТРАЦІЄЮ ЗА КАТЕГОРІЄЮ ТА ЗВО
router.get("/my"); // ОТРИМАННЯ МОЇХ ТЕСТІВ, ЯКІ Я СТВОРИВ
router.post("/"); // СТВОРЕННЯ ТЕСТУ З ПИТАННЯМИ ТА ВАРІАНТАМИ ВІДПОВІДІ ТА ТИПОМ ДОСТУПУ(ПУБЛІЧНИЙ, ЗА ДОМЕНОМ, ЗА ПОШТАМИ)
router.put("/:id"); // ОНОВЛЕННЯ ТЕСТУ
router.get("/:id"); // ОТРИМАННЯ ДЕТАЛЬНОЇ ІНФОРМАЦІЇ ПРО ТЕСТ
router.delete("/:id"); // ВИДАЛЕННЯ ТЕСТУ

export default router;
